articles_api/app/graphql/mutations/create_article.rb

INSERT INTO "articles" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["content", "content of new user"], ["created_at", "2024-07-10 14:54:05.542330"], ["updated_at", "2024-07-10 14:54:05.542330"]]
---
	def resolve(user_id:, content:)
		article = Article.new(user_id: user_id, content: content)

		if article.save