user_api/app/graphql/types/query_type.rb

    def user(id: )
      User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]