user_api/app/graphql/types/user_type.rb

    def books_count
      object.books.size
---
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]