user_api/app/graphql/mutations/create_user.rb

INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "me@mattboldt.com"], ["name", "Matt Boldt"], ["created_at", "2024-07-08 14:57:39.801040"], ["updated_at", "2024-07-08 14:57:39.801040"]]
---
	def resolve(name:, email:)
		user = User.new(name: name, email: email)
		if user.save